app/controllers/oauth_clients_controller.rb

SELECT * FROM `client_applications` WHERE (`client_applications`.user_id = 1)
SELECT * FROM `oauth_tokens` WHERE (`oauth_tokens`.user_id = 1 AND (oauth_tokens.invalidated_at is null and oauth_tokens.authorized_at is not null)) ORDER BY authorized_at desc
---
  def index
    @client_applications = current_user.client_applications
    @tokens = current_user.tokens.find :all, :conditions => 'oauth_tokens.invalidated_at is null and oauth_tokens.authorized_at is not null'

INSERT INTO `client_applications` (`name`, `created_at`, `support_url`, `callback_url`, `updated_at`, `url`, `user_id`, `key`, `secret`) VALUES('car', '2011-06-22 07:53:34', 'http://www.support.com', 'http://forum.byr.edu.cn', '2011-06-22 07:53:34', 'http://www.smartbupt.com', 1, 'vHTjIUDZImDjKZvDf7wc', 'g7nul1RQ1AKFTxdujvQKQVJakDveU4LVZ53BZpNG')
---
  def create
    @client_application = current_user.client_applications.build(params[:client_application])
    if @client_application.save

UPDATE `client_applications` SET `updated_at` = '2011-06-29 08:17:02', `callback_url` = 'http://localhost:3000' WHERE `id` = 1
---
  def update
    if @client_application.update_attributes(params[:client_application])